cases/Hecht_Panda_2019/cryogenic_H2_test_02/0.orig/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
// Inlet: effectively zero per Giannissi (2021).
// Internal: eps = Cmu^(3/4)*k^(3/2)/L, L~0.05m domain scale.

dimensions      [0 2 -3 0 0 0 0];

internalField   uniform 9.03e-6;

boundaryField
{
    nozzleInlet
    {
        type            fixedValue;
        value           uniform 1e-6;
    }
    nozzleWall
    {
        type            epsilonWallFunction;
        Cmu             0.09;
        kappa           0.41;
        E               9.8;
        value           $internalField;
    }
    bottomWall
    {
        type            epsilonWallFunction;
        Cmu             0.09;
        kappa           0.41;
        E               9.8;
        value           $internalField;
    }
    outlet
    {
        type            inletOutlet;
        inletValue      $internalField;
        value           $internalField;
    }
    "(front|back)"
    {
        type            wedge;
    }
    axis
    {
        type            symmetry;
    }
}

// ************************************************************************* //
